tryuser/app/views/posts/index.html.erb

      <tr>
        <td><%= User.find(post.user_id).name.capitalize %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]