tryuser/app/controllers/comments_controller.rb

	def index
		@c = Comment.all;
---
SELECT "comments".* FROM "comments"