tryuser/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "wael"], ["post_id", 1], ["user_id", 1], ["created_at", "2015-02-18 06:19:21.732653"], ["updated_at", "2015-02-18 06:19:21.732653"]]
---
  def create
    @comment = @post.comments.new(comment_params)
    @comment.user_id = session[:user_id]
    respond_to do |format|
      if @comment.save

UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "helloss"], ["updated_at", "2015-02-17 14:14:55.911151"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @comment.update(comment_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 5]]
---
    def set_comment
      @post = Post.find(params[:post_id])
      @comment = @post.comments.find(params[:id])