tryuser/app/controllers/posts_controller.rb

  def new
    if session[:user_id].blank?
      redirect_to posts_path , notice: "Please Log in to create a new post"
    else
      if !User.find(session[:user_id]).is_auth
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @post = Post.new(post_params)
    @post.user_id = session[:user_id]
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "ahmed"], ["content", "ahmed"], ["user_id", 1], ["created_at", "2015-02-16 20:54:56.239652"], ["updated_at", "2015-02-16 20:54:56.239652"]]