tryuser/app/controllers/replies_controller.rb

  def create
    @reply = @comment.replies.new(reply_params)
    @reply.user_id = session[:user_id]
    respond_to do |format|
      if @reply.save
---
INSERT INTO "replies" ("content", "comment_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "sdfghj"], ["comment_id", 9], ["user_id", 1], ["created_at", "2015-02-19 08:04:27.377644"], ["updated_at", "2015-02-19 08:04:27.377644"]]

    def set_reply
      @post = Post.find(params[:post_id])
      @comment = @post.comments.find(params[:comment_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1  [["post_id", 2], ["id", 9]]