tryuser/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "password", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "ahmed wael"], ["password", "123"], ["email", "ahmed@gmail.com"], ["created_at", "2015-02-16 20:52:52.856584"], ["updated_at", "2015-02-16 20:52:52.856584"]]